In [0]:
#NOTEBOOK OTHER PEOPLE CANT EDIT

<img style="width:480px;max-width:100%;" src="https://github.com/dejaworkman/IST210/blob/master/Group%20Assignment%202.png?raw=true" alt="Drawing" title="ER">

In [0]:
import sqlite3 # Once imported in a single notebook, it is available to us throughout the rest of the notebook. 
# connect to database, if not there, create it.
connectionToDatabase = sqlite3.connect('DealerDB') 
cursor = connectionToDatabase.cursor()
connectionToDatabase.commit()

In [0]:
#Vehicle table
cursor.execute('''create table vehicle (vehicle_ID int PRIMARY KEY, make text, model text, year int)''')
connectionToDatabase.commit()

In [0]:
cursor.execute('''INSERT INTO vehicle VALUES (423, "audi", "a4", 2008)''')
cursor.execute('''INSERT INTO vehicle VALUES (526, "volkswagen", "golf_gti", 2017)''')
cursor.execute('''INSERT INTO vehicle VALUES (223, "volkswagen", "passat", 2004)''')
cursor.execute('''INSERT INTO vehicle VALUES (724, "porsche", "macan", 2018)''')
cursor.execute('''INSERT INTO vehicle VALUES (458, "audi", "s5", 2013)''')
connectionToDatabase.commit()

In [0]:
#Unit table
cursor.execute('''create table unit (vin text PRIMARY KEY, vehicle_ID int, retail float, mileage int, optionsPackage int, location_ID int)''')
connectionToDatabase.commit()

In [0]:
cursor.execute('''INSERT INTO unit VALUES ("1FUJA6AS83LK36671", 423, 18245.15, 71002, 1, 142)''')
cursor.execute('''INSERT INTO unit VALUES ("1FUJA6AS83LK36682", 526, 12013.75, 104231, 2, 34)''')
cursor.execute('''INSERT INTO unit VALUES ("1KUJB6AS83LK36531", 526, 9004.50, 15072, 1, 36)''')
cursor.execute('''INSERT INTO unit VALUES ("1FUJA6B1C3LK37621", 724, 72857.26, 21424, 5, 246)''')
cursor.execute('''INSERT INTO unit VALUES ("1FUJA6ASSLKK36492", 458, 35083.77, 45560, 7, 122)''')

connectionToDatabase.commit()

In [0]:
#Sale table
cursor.execute('''create table sale (tansaction_ID int PRIMARY KEY, itemPurchased text, finalSale float, customer_ID int)''')
connectionToDatabase.commit()

In [0]:
cursor.execute('''INSERT INTO sale VALUES (1, "476F8J37810LVNM25", 42327.50, 23472)''')
cursor.execute('''INSERT INTO sale VALUES (2, "236F8J37810LVLR25", 78923.10, 23473)''')
cursor.execute('''INSERT INTO sale VALUES (3, "126F8RXL810LVNM24", 144678.66, 12468)''')
cursor.execute('''INSERT INTO sale VALUES (4, "476F8H37810Z77725", 12116.50, 23474)''')
cursor.execute('''INSERT INTO sale VALUES (5, "476F8J347DNNVNM33", 42440.75, 10446)''')

connectionToDatabase.commit()

In [0]:
#Customer table
cursor.execute('''create table customer (customer_ID int PRIMARY KEY, firstName text, lastName text, email text, phoneNum int)''')
connectionToDatabase.commit()

In [0]:
cursor.execute('''INSERT INTO customer VALUES (10, "Pat", "Seltzer", "pseltz@gmail.com", 4247776628)''')
cursor.execute('''INSERT INTO customer VALUES (11, "Arnie", "Schwarz", "t800@yahoo.com", 1112223344)''')
cursor.execute('''INSERT INTO customer VALUES (12, "Eric", "Trumpy", "etrumpy@gmail.com", 6667823442)''')
cursor.execute('''INSERT INTO customer VALUES (13, "Kev", "Har", "khar@outlook.com", 1234567890)''')
cursor.execute('''INSERT INTO customer VALUES (14, "Robin", "Scherbotsky", "imissted@gmail.com", 1244778888)''')

connectionToDatabase.commit()

In [0]:
#Location table
cursor.execute('''create table location (location_ID int PRIMARY KEY, lotNum int, spotNum int)''')
connectionToDatabase.commit()

In [0]:
cursor.execute('''INSERT INTO location VALUES (1, 1, 1)''')
cursor.execute('''INSERT INTO location VALUES (2, 1, 2)''')
cursor.execute('''INSERT INTO location VALUES (36, 1, 3)''')
cursor.execute('''INSERT INTO location VALUES (34, 1, 4)''')
cursor.execute('''INSERT INTO location VALUES (5, 2, 1)''')
connectionToDatabase.commit()

<h3>Query time</h3>

In [12]:
#What Porsches do we have in inventory
cursor.execute('''SELECT v.make, v.model, v.year FROM unit u, vehicle v WHERE u.vehicle_ID=v.vehicle_ID AND make = "porsche"''')
for row in cursor.fetchall():
  print (row)

('porsche', 'macan', 2018)

This question is a pretty simple inventory check.  It is simple, yet probably pretty important if you have a car dealership.  The query itself is pretty simple and straightforward - it is just selecting constrained make, model and year from our vehicle data with matching inventory vehicle_IDs.

In [13]:
#Say one of our customers wants to test drive a Volkswagen Golf variant - we want to get the car for him.  What is the location ID?
cursor.execute('''SELECT v.make, v.model, v.year, u.location_ID FROM vehicle v, unit u WHERE v.vehicle_ID = u.vehicle_ID AND v.model LIKE "golf%"''')
for row in cursor.fetchall():
  print (row)

('volkswagen', 'golf_gti', 2017, 34)
('volkswagen', 'golf_gti', 2017, 36)

In [14]:
#Now that we have location ID, what lots and spaces are they in?
cursor.execute('''SELECT lotNum, spotNUM FROM location WHERE location_ID=34 OR location_ID=36''')
for row in cursor.fetchall():
  print (row)

(1, 4)
(1, 3)

This is sort of a compound query here.  This is a pretty realistic scenario - customer wants a test drive.  Where are the cars?  First, we find which cars we have (in case of customer preference), alongside a location ID.  With that location ID, we can then find which lot and spot number they're in.

In [15]:
#What email do I have on file for customer Robin Scherbotsky?
cursor.execute('''SELECT email FROM customer WHERE firstName = "Robin" AND lastName = "Scherbotsky"''')
for row in cursor.fetchall():
  print (row)

('imissted@gmail.com',)

Say our customer is complaining about not getting confirmation emails.  These emails may contain sensitive info - so we have to make sure this is correct.  Here, we check what email our customer Robin has saved with us.  This one is just a select statement from a single table with 2 constraints, first name and last name.